---
kind: other
id: Methods.T:Autodesk.Revit.UI.IExternalCommand
source: html/c8eb3663-5093-d6be-469c-a87372620ae3.htm
---
# IExternalCommand Methods

Overload this method to implement and external command within Revit.